app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "9"]]
---
  def show
    id = params[:id] # retrieve movie ID from URI route
    @movie = Movie.find(id) # look up movie by unique ID

SELECT "movies".* FROM "movies" WHERE (rating = 'G','R')
SELECT "movies".* FROM "movies" WHERE "rating"."G" = '1' AND "rating"."R" = '1' AND "rating"."NC-17" = '1'
---
  def index
    # Setup @all_ratings with array of all ratings in use in db
    @all_ratings ||= []
    Movie.all.each do |movie|
      @all_ratings << movie.rating
    end
    @all_ratings = @all_ratings.uniq

    # Create array @ratings of all checked ratings
    @ratings = params[:ratings]
    if @ratings != nil
      session[:ratings] = @ratings.keys
    end

    # Load movie list with @order and @rating filet
    session[:order] = params[:sort]
    @movies = Movie.where(:rating => session[:ratings]).order(session[:order])

INSERT INTO "movies" ("created_at", "description", "rating", "release_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @movie = Movie.create!(params[:movie])

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "13"]]
---
  def edit

    @movie = Movie.find params[:id]

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "13"]]
UPDATE "movies" SET "title" = 'Test', "updated_at" = '2014-09-02 19:03:22.037872' WHERE "movies"."id" = 13
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "16"]]
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 16]]
---
  def destroy
    @movie = Movie.find(params[:id])
    @movie.destroy